In [1]:
import pandas as pd

In [2]:
purchasefile = "purchase_data.json"

In [3]:
purchase_df = pd.read_json(purchasefile)
purchase_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [4]:
unique_users = purchase_df["SN"].value_counts()
#unique_users.count()
unique_users.count()
#purchase_df["SN"].value_counts()

573

In [5]:
unique_items = purchase_df["Item ID"].value_counts()
unique_items.count()

183

In [6]:
purchase_df["Price"].mean()

2.931192307692303

In [7]:
purchase_df["Item ID"].count()

780

In [8]:
purchase_df["Price"].sum()

2286.33

In [9]:
purchase_analysis_total = pd.DataFrame ({"Number of Unique Items": unique_items.count(),
                                  "Average Price": purchase_df["Price"].mean(),
                                  "Number of Purchases": purchase_df["Item ID"].count(),
                                  "Total Revenue": purchase_df["Price"].sum()
                                  },index = [0])
purchase_analysis_total_reorg = purchase_analysis_total[["Number of Unique Items","Average Price","Number of Purchases","Total Revenue"]]
purchase_analysis_total_reorg

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       2.931192                  780        2286.33

In [10]:
female_df = purchase_df.loc[purchase_df["Gender"] == "Female",:]
uniquefemale = female_df["SN"].value_counts()
uniquefemale.count()

100

In [11]:
male_df = purchase_df.loc[purchase_df["Gender"] == "Male",:]
uniquemale = male_df["SN"].value_counts()
uniquemale.count()

465

In [12]:
othergender_df = purchase_df.loc[(purchase_df["Gender"] != "Male") & (purchase_df["Gender"] != "Female"),:]
uniqueother = othergender_df["SN"].value_counts()
uniqueother.count()

8

In [27]:
gender_grp = purchase_df.groupby(["Gender"], as_index = False)
gender_grp.mean()

                  Gender        Age     Item ID     Price
0                 Female  22.558824   88.110294  2.815515
1                   Male  22.685624   91.571880  2.950521
2  Other / Non-Disclosed  27.363636  114.636364  3.249091

In [28]:
genders =(gender_grp.mean())["Gender"]
genders

0                   Female
1                     Male
2    Other / Non-Disclosed
Name: Gender, dtype: object

In [45]:
gender_demo = pd.DataFrame({
    "Gender": genders,
    "Total Count": [uniquefemale.count(), uniquemale.count(), uniqueother.count()],
    "Percentage of Players":[round((uniquefemale.count()/unique_users.count())*100,6),round((uniquemale.count()/unique_users.count())*100,6),round((uniqueother.count()/unique_users.count())*100,6)]
    })

gender_sorted = gender_demo.sort_values("Total Count", ascending=False)
gender_sorted.set_index("Gender")
gender_demo["Total Count"]

0    100
1    465
2      8
Name: Total Count, dtype: int64

In [30]:
gender_grp.mean()

                  Gender        Age     Item ID     Price
0                 Female  22.558824   88.110294  2.815515
1                   Male  22.685624   91.571880  2.950521
2  Other / Non-Disclosed  27.363636  114.636364  3.249091

In [39]:
(gender_grp.count())["Item ID"]

0    136
1    633
2     11
Name: Item ID, dtype: int64

In [32]:
gender_grp.sum()

                  Gender    Age  Item ID    Price
0                 Female   3068    11983   382.91
1                   Male  14360    57965  1867.68
2  Other / Non-Disclosed    301     1261    35.74

In [33]:
gender_grp.max()

,Gender,Age,Item ID,Item Name,Price,SN
0,Female,40,182,Yearning Mageblade,4.95,Yasurra52
1,Male,45,183,Yearning Mageblade,4.95,Zontibe81
2,Other / Non-Disclosed,34,183,"Wolf, Promise of the Moonwalker",4.32,Tyaerith73

In [ ]:
total_price = gender_grp["Price"].sum()

In [ ]:
type(total_price)

In [ ]:
total_price

In [ ]:
gender_grp["Price"].max()

In [ ]:
gender_grp["Price"].min()

In [47]:
purchase_analysis_gender = pd.DataFrame({"Gender": genders,
                                        "Purchase count":(gender_grp.count())["Item ID"],
                                        "Average Purchase Price":(gender_grp.mean())["Price"],
                                        "Total Purchase Value":(gender_grp.sum())["Price"],
                                        "Normalized Totals":round((gender_grp.sum())["Price"]/gender_demo["Total Count"],2)
                                        })
purchase_analysis_gender_reorg = purchase_analysis_gender[["Gender","Purchase count","Average Purchase Price","Total Purchase Value","Normalized Totals"]]
purchase_analysis_gender_reorg.set_index("Gender")

,Purchase count,Average Purchase Price,Total Purchase Value,Normalized Totals
Gender,,,,
Female,136,2.815515,382.91,3.83
Male,633,2.950521,1867.68,4.02
Other / Non-Disclosed,11,3.249091,35.74,4.47

In [49]:
min(purchase_df["Age"])

7

In [77]:
bins = [5,9,14,19,24,29,34,39,50]

# Create labels for these bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

Agedemo_series = pd.cut(purchase_df["Age"], bins, labels=group_labels)
purchase_df["AgeRange"] = Agedemo_series
purchase_df1 = purchase_df
purchase_df1 = purchase_df1.drop_duplicates(['SN'], keep='first')
Agedemo_grp = purchase_df1.groupby("AgeRange",as_index=False)
Agedemo_grp1 = purchase_df.groupby("AgeRange",as_index=False)
Agedemo_grp.count()

  AgeRange  Age  Gender  Item ID  Item Name  Price   SN
0      <10   19      19       19         19     19   19
1    10-14   23      23       23         23     23   23
2    15-19  100     100      100        100    100  100
3    20-24  259     259      259        259    259  259
4    25-29   87      87       87         87     87   87
5    30-34   47      47       47         47     47   47
6    35-39   27      27       27         27     27   27
7      40+   11      11       11         11     11   11

In [78]:
age_demo = pd.DataFrame({" ":(Agedemo_grp.count())["AgeRange"],
                        "Percentage of Players":round(((Agedemo_grp.count())["SN"]/unique_users.count())*100,2),
                        "Total Count":(Agedemo_grp.count())["SN"]})
age_demo.set_index(" ")

       Percentage of Players  Total Count

<10                     3.32           19
10-14                   4.01           23
15-19                  17.45          100
20-24                  45.20          259
25-29                  15.18           87
30-34                   8.20           47
35-39                   4.71           27
40+                     1.92           11

In [81]:
Agedemo_grp1.sum()

  AgeRange   Age  Item ID   Price
0      <10   211     2305   83.46
1    10-14   426     3171   96.95
2    15-19  2212    12561  386.42
3    20-24  7350    28909  978.77
4    25-29  3275    11729  370.33
5    30-34  2023     6493  197.25
6    35-39  1542     4497  119.40
7      40+   690     1544   53.75

In [82]:
Agedemo_grp1.count()

  AgeRange  Age  Gender  Item ID  Item Name  Price   SN
0      <10   28      28       28         28     28   28
1    10-14   35      35       35         35     35   35
2    15-19  133     133      133        133    133  133
3    20-24  336     336      336        336    336  336
4    25-29  125     125      125        125    125  125
5    30-34   64      64       64         64     64   64
6    35-39   42      42       42         42     42   42
7      40+   17      17       17         17     17   17

In [83]:
Agedemo_grp1.mean()

  AgeRange        Age     Item ID     Price
0      <10   7.535714   82.321429  2.980714
1    10-14  12.171429   90.600000  2.770000
2    15-19  16.631579   94.443609  2.905414
3    20-24  21.875000   86.038690  2.913006
4    25-29  26.200000   93.832000  2.962640
5    30-34  31.609375  101.453125  3.082031
6    35-39  36.714286  107.071429  2.842857
7      40+  40.588235   90.823529  3.161765

In [101]:
purchase_analysis_age = pd.DataFrame({" ":(Agedemo_grp.count())["AgeRange"],
                          "Purchase Count":(Agedemo_grp1.count())["SN"],
                          "Average Purchase Price":round((Agedemo_grp1.mean())["Price"],2),
                          "Total Purchase Value":(Agedemo_grp1.sum())["Price"],
                          "Normalized Totals":round(((Agedemo_grp1.sum())["Price"]/(Agedemo_grp.count())["SN"]),2)
                         })
purchase_analysis_age_reorg = purchase_analysis_age[[" ","Purchase Count","Average Purchase Price","Total Purchase Value","Normalized Totals"]].set_index(" ")
purchase_analysis_age_reorg

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
,,,,
<10,28,2.98,83.46,4.39
10-14,35,2.77,96.95,4.22
15-19,133,2.91,386.42,3.86
20-24,336,2.91,978.77,3.78
25-29,125,2.96,370.33,4.26
30-34,64,3.08,197.25,4.20
35-39,42,2.84,119.40,4.42
40+,17,3.16,53.75,4.89

In [123]:
topspenders = purchase_df.groupby("SN")
topspendertotal = topspenders.sum()
topspendertotal["Average Purchase Price"] = (topspenders.mean())["Price"]
topspendertotal["Purchase Count"] = (topspenders.count())["Item ID"]
topspendertotal.sort_values("Price", ascending = False)
del topspendertotal["Age"]
del topspendertotal["Item ID"]
topspendertotal = topspendertotal.rename(columns={"Price": "Total Purchase Value"})
topspendertotal = topspendertotal[["Purchase Count","Average Purchase Price","Total Purchase Value"]]
topspendertotal.sort_values("Total Purchase Value", ascending = False).head(5)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Undirrala66               5                3.412000                 17.06
Saedue76                  4                3.390000                 13.56
Mindimnya67               4                3.185000                 12.74
Haellysu29                3                4.243333                 12.73
Eoda93                    3                3.860000                 11.58

In [148]:
mostpopular = purchase_df.groupby(["Item ID","Item Name"])
#mostpopular.count()

In [149]:
#mostpopular.sum()

In [150]:
#mostpopular.mean()

In [151]:
purchase_count = mostpopular.count()

In [152]:
purchase_count["Item Price"] = (mostpopular.mean())["Price"]
purchase_count["Total Purchase Value"] = (mostpopular.sum())["Price"]
purchase_count1 = purchase_count[["SN","Item Price","Total Purchase Value"]].sort_values("SN",ascending = False).head(5)
purchase_count1 = purchase_count1.rename(columns={"SN": "Purchase Count"})
purchase_count1

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
39,"Betrayal, Whisper of Grieving Widows",11,2.35,25.85
84,Arcane Gem,11,2.23,24.53
31,Trickster,9,2.07,18.63
175,Woeful Adamantite Claymore,9,1.24,11.16
13,Serenity,9,1.49,13.41

In [153]:
purchase_count2 = purchase_count[["SN","Item Price","Total Purchase Value"]].sort_values("Total Purchase Value",ascending = False).head(5)
purchase_count2 = purchase_count2.rename(columns={"SN": "Purchase Count"})
purchase_count2

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
34,Retribution Axe,9,4.14,37.26
115,Spectral Diamond Doomblade,7,4.25,29.75
32,Orenmir,6,4.95,29.70
103,Singed Scalpel,6,4.87,29.22
107,"Splitter, Foe Of Subtlety",8,3.61,28.88